# GridLineWeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColoredSurfaceSettings..::..GridLineWeight Property
AnalysisDisplayColoredSurfaceSettings Class See Also
---
Line weight of grid lines.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public int GridLineWeight { get; set; }
```

Visual Basic
---
```text
Public Property GridLineWeight As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int GridLineWeight {
	int get ();
	void set (int value);
}
```

# See Also
AnalysisDisplayColoredSurfaceSettings Class
Autodesk.Revit.DB.Analysis Namespace